[
    {
        "companyName": "Sibitalent",
        "title": "Business Intelligence Consultant",
        "location": "USA",
        "description": "About the job: Title: BI and Analytics Engineer Location : Remote, but working CST HoursDuration: 6+ MonthsExp: 12+. . . . . . . . . . . . . . . . . . . . . . Only W2. . . . . . . . . . . . . . . . . . . . . . . Job Description:What I need:1. PowerBI development skills2. Semantic modeling skills3. SQL skills4. Understanding of Oracle Data5. Domain experience is a nice to have in any of the following domains: Sales, Finance, marketing, procurement, supply chain, manufacturing, service, quality, distribution.",
        "requirements": ""
    },
    {
        "companyName": "Innova Solutions",
        "title": "SQL Developer",
        "location": "-",
        "description": "-",
        "requirements": ""
    },
    {
        "companyName": "City of Atlanta",
        "title": "Data, Strategy and Innovation - Director",
        "location": "Atlanta, Fulton County, Georgia, USA",
        "description": "About the job: Job DescriptionPosting Open Until FilledSalary Range: $74, 800 - $124, 600General Description And Classification StandardsThe Atlanta Department of City Planning (DCP) is committed to implementing Atlanta City Design and transforming Atlanta into the best possible version of itself. Adopted into the City Charter in December 2017, Atlanta City Design articulates an aspiration for the future city that Atlantans can fall in love with, knowing that if people love their city, they will make better decisions about it. The Department's objective is to guide the development of the City through planning, design review, plan approval, code compliance, and housing assistance. The Department works closely with the Neighborhood Planning Units, independent community organizations, and developers to provide policy guidance and assistance to support the growth of our community. DCP is seeking to hire a Director of Data, Strategy and Innovation who understands industry and business operation trends and can identify strategic insights and turn those insights into organization-wide transformation. The Director will report directly to the Deputy Commissioner of Operations. Providing supervision to two teams, Project Management and Operations and Analytics, collectively this team is charged with driving organizational change, supporting and maintaining department data collection systems, identifying and measuring on key performance indicators, and improving operational efficiency and performance. The Director will work closely with the Department's Operational Offices to develop, manage, maintain, execute cross-functional initiatives and will be held accountable for the identification, qualification and capture of work processes and development of efficient methods for improved organizational efficiency in the department. The Director will assess opportunities as well as help review systems, operations, processes, customers, market and data for decision making. This role also conducts various planning and department improvement activities, including the oversight for data collection and analysis. This is a fully seasoned managerial level charged with responsibility for significant specialized functions within a department. Position manages a group of employees, typically with an intermediate supervisor, or a smaller group of specialized professional employees. Areas of responsibility are typically unique within the department. Supervision ReceivedDirection received is general and focuses more on long-term and short-term operating objectives, managerial effectiveness, and operating results. This level would be considered \"middle\" management. ResponsibilitiesEssential Duties & Responsibilities These are typical responsibilities for this position and should not be construed as exclusive or all inclusive. May perform other duties as assigned. Serves on the leadership team of the Department of City Planning. Contributes to the development and execution of department goals, budgets, and operations - providing subject matter expertise on community and economic development. Manages, coordinates, and supports innovative department-wide activities that result in improvements to existing structures and systems to maximize program performance. Refines, implements, and integrates the departments vision as expressed in Atlanta City Design, the CDP, and other strategic plan framework into the existing performance management system(s). Leads the design and implementation of data governance and data management frameworks, ensuring data quality, integrity, and security. Defines a multiyear operations and performance management strategy and roadmap for success with input from the Commissioner and Leadership team. Stays abreast with emerging technologies, industry trends, and best practices in data analytics and innovation to drive continuous improvement. Manages a team of project managers, data professionals, and system administrators, providing guidance, mentoring, and support to achieve strategic objectives. Building support, by utilizing excellent communication and leadership skills in driving projects. Oversees the collection of performance management tools. Uses project management tools and data-driven analysis to identify problem areas and opportunities, set targets and design and implement action-oriented plans to drive tangible results for the City. Develops actionable recommendations and implementation plans that take budget/ policy constraints into account and evaluate impact of change on service delivery, productivity, and cost efficiency. Actively manages medium to large-scale projects, including leading project meetings, facilitating project team interaction, managing scope, managing deadlines, managing project budgets, and ensuring on-time delivery of solutions. Produces clear, concise, and consistent deliverables to communicate problems and recommendations with attention to presentation and potential audiences. Manages and maintains strong relationships with a broad set of stakeholders, including government officials and private and public sector partners. Helps define, accelerate, track, and lead key cross functional initiatives and results while reporting on performance measures and effectiveness of implemented strategies, including crafting project plans and tracking progress across projects to keep roadmaps progressing on schedule. Distills information, synthesizes ambiguous problems, and develops structured analysis to tell a cohesive story for leaders across the organization. Uses strong interpersonal skills to engage team members, clients, and partners to communicate business expectations to the technical experts to facilitate desired outcomes. Coordinates program activities with other departments, outside agencies, stakeholders and customers. Negotiates resolutions of problems and contractual agreements, both internal and external to the organization. Monitors and evaluates the efficiency and effectiveness of program delivery and directs improvements. Selects, trains, supervises, and evaluates the performance of staff. Ensures employee development and succession. Collaborates with agencies and other stakeholders to launch innovative programs focused on areas such as inclusionary zoning, blight remediation, and community revitalization. Decision MakingThis position has department-wide responsibility for all aspects of decisions and/or an action related to driving organizational change, supporting and maintaining department data collection systems, identifying and measuring on key performance indicators, and improving operational efficiency and performance. Leadership ProvidedManages an assigned group of data/GIS professionals and technical employees; position also provides innovative program leadership and influence with respect to related agencies and other governmental bodies. Knowledge, Skills & AbilitiesThe ideal candidate is ready to work in a high-energy, openly collaborative work environment. They have a history of demonstrable success in planning, project management and equity based and data-driven decision making. They are persistent, friendly, and concise. We seek engaged professionals with outstanding quantitative, strategic, and interpersonal skills. Below is a partial listing of necessary knowledge, skills, and abilities required to perform the job successfully. It is not an exhaustive list. Experience delivering medium to large-scale projects on time and within budget. Experience conducting detailed quantitative analysis including working with large data sets, financial modeling, and basic statistical analysis. Exceptional problem-solving skills with an ability to anticipate challenges and develop solutions on deadline. Strong attention to detail. Strong leadership and communication skills to effectively collaborate with cross-functional teams and influence stakeholders. Enterprising, resourceful results-oriented approach to work. Ability to prioritize among competing needs and opportunities and manage multiple projects or work streams at the same time. Ability to thoughtfully communicate with and respectfully engage diverse stakeholders around a shared vision for achieving results. Experience in driving organizational change and fostering a culture of data-driven decision-makingStrong verbal, written and presentation skills. Ability to work collaboratively to arrive at constructive solutions. Ability to manage stakeholders such volunteer citizen commission members, City employees, Mayor's Office, architects, developers, citizens, other organizations with interest in zoning and development. Ability to manage projects and lead a team to achieve results. Knowledge of change management and process improvement. Budget development and management. Knowledge relevant computer software. ResponsibilitiesMinimum Qualifications - Education and ExperienceUndergraduate Degree in Business/Public administration, Finance, Public Health, Public Policy, Urban or Regional Planning, Organizational Development, or other data driven field. 5-7 years of experience in strategic planning, data strategy and analytics, business analysis, project management, finance, operations, or consulting experience in a demanding analytic environment; experience in management, strategy or operational consulting preferred, with at least three (3) years of supervisory experience. Preferred Education & ExperienceMaster's Degree in Business/Public administration, Finance, Public Health, Public Policy, Urban or Regional Planning, Organizational Development, or other data driven field. 8-9 years of progressive professional-level experience in strategic planning, data strategy and analytics, business analysis, project management, finance, operations, or consulting experience in a demanding analytic environment; experience in management, strategy or operational consulting preferred, with at least four (4) years of supervisory experience. Licensures and CertificationsValid Georgia driver's license required. Essential Capabilities And Work EnvironmentRequired physical, lifting, and sensory capabilities are requirements to perform the job successfully. Typical environmental conditions associated with job. QualificationsThe City of Atlanta is an Equal Opportunity Employer and does not unlawfully discriminate on the basis of race, color, religion, age, disability, sex, sexual orientation, ender identity, marital status, veteran's status or national origin, or any other basis prohibited by federal, state, or local law. We value and encourage diversity in our workforce.",
        "requirements": ""
    },
    {
        "companyName": "Playwire",
        "title": "Senior Director of Data Engineering",
        "location": "USA",
        "description": "About the job: Playwire is a full-service digital innovation partner specializing in online advertising and proprietary technologies to elevate publishing brands. As we continue our rapid expansion, we seek a skilled Senior Director of Data Engineering is responsible for leading Playwire's data and engineering practices, including data analytics, warehousing, business intelligence, predictive machine learning models, and engineering functions. In this role, you will lead the data team, ensuring operational excellence, fosters innovation, and drives alignment between data and engineering initiatives. Reporting to the EVP of Technology, the Senior Director collaborates across teams to deliver solutions that enable decision-making and support the organization's strategic goals. Essential FunctionsOversees the day-to-day operations of the data team, ensuring progress on key initiatives and resolving technical blockers. Leads the implementation and optimization of technologies and systems for data management, processing, and engineering infrastructure. Collaborates with Playwire's leadership team to align data and engineering strategies with business goals, providing actionable insights and technical recommendations. Partners with the Product team to refine processes and deliver and deploy data-driven product solutions including ML based predictive models. Establishes best practices for data engineering, ensuring scalable, secure, and efficient systems and processes. Provides business intelligence tools and data analysis capabilities to support teams in problem-solving and decision-making. Maintains compliance with data and engineering policies, standards, and security measures to protect organizational assets. Guides engineering efforts in building robust data pipelines, integrations, and scalable architecture. Partners with the Yield Ops team to support experiments and develop predictive systems for revenue optimization. Educates teams on data and engineering methodologies, fostering a culture of innovation and technical excellence. Manages vendor relationships and contracts for third-party tools, ensuring cost efficiency and integration success. Leads project management efforts within the data and engineering teams, including delegation, resource allocation, and adherence to deadlines. Identifies and addresses team skill gaps, participating in hiring, development, and mentoring to build a high-performing team. QualificationsBachelor's degree in Computer Science, Engineering, or a related field, or equivalent experience. 8+ years of experience in data and engineering roles, including leadership responsibilities. 2+ years of supervisory experience, with a proven track record of team building and mentorship. Hands-on experience with data management and engineering tools, such as SQL, Python, Spark, or similar technologies. Experience with data visualization tools (e. g. , Tableau) and engineering platforms (e. g. , AWS, GCP). Strong analytical and technical problem-solving skills, with expertise in both data and engineering contexts. Proficiency in software development practices, infrastructure management, and scalable system design. Familiarity with machine learning workflows and predictive modeling, including partnerships with product teams to deploy models.",
        "requirements": ""
    },
    {
        "companyName": "Sun Technologies",
        "title": "Business/QA Analyst",
        "location": "-",
        "description": "Hello, Greetings from Sun Technologies! I hope this message finds you well. I am reaching out to see if you would be interested in exploring new opportunities. I'm Shreya Technical Recruiter at Sun Technologies Inc. , Our records show that you have past or current experience with skills matching our direct client requirements. If you are interested in applying for this position, please reply to this email with an updated copy of your resume along with the requested details below: Full Legal Name (AS PER DRIVER'S LICENSE CARD):First name:Middle name:Last name:Current Location:Willing to work Remote:Work authorization:Willing to take a drug test and background check (yes/no):Reason for the job change:Availability to start the assignment: Role: Business/QA Analyst(754475)Duration: Expected to be 5 months contract with possible extensionLocation: Remote Pay Rate:$46. 59/hr (the pay rate may differ depending on your skills, education, experience, and other qualifications). Featured Benefits:Medical Insurance in compliance with the ACA401(k)Sick leave in compliance with applicable state, federal, and local lawsJob Description:Complete Description: Duties and responsibilities:Identifies and defines business requirements by quickly understanding business and technical requirements based on the input and opinions from a diverse group of usersWorks on process flows and screen designs and provides storyboarding to support system design. Review and interpret ongoing business requirements. Documents business requirements in a suitable format that communicates the specific functionality that will be developed for the product and obtains appropriate approvals. Articulate, Communicate, and Coordinate with UI/UX, app development, backend, CMS, Testing, and other and subject matter experts on design & development. Works closely with the applications manager to create and maintain product roadmaps, epics, user stories, use cases, and other product documentation. Write test cases based on wireframes, comps, and functional requirementsConduct functional testing and cross-browser and mobile device testingBe responsible for the end-to-end testing of complete, interactive web and mobile applicationsMonitor and identify problems with content, layout, usability, accessibility, functionality, guidelines, and more across multiple browsers and devicesReview product specifications and develop effective testing strategies, plans, and tools to ensure project goals are metThoroughly test solutions to ensure functionality and integrityAbility to write queries using SQL and compile data and reports as needed. Manage and maintain all requirements materials and traceability matricesHelp Desk support as needed to support production applicationsQualifications:Bachelor's degree in computer science, IT, MIS, Engineering, or related fields. 7+ years of experience as a BA/QA Analyst. Experience across the SDLC, including requirements, design, development, testing, documentation, training, deployment, operations, support, and maintenance. Ability to work well with business unit SMEs, Business Analysts, vendors, and end users in cross-functional teams. Extremely detail-oriented, organized, structured, analytical, and logical, with strong problem-solving skills. Track record of meeting or exceeding client expectations, personal performance expectations, and achieving project goals. Thanks & Regards, Shreya M (Associate Technical Recruiter)Sun Technologies, Inc. | 3700 MANSELL RD. , STE 220, ALPHARETTA, GA 30022Work: 678 785 1335 | Email ID: shreyam@suntechnologies. com http://www. suntechnologies. com",
        "requirements": ""
    },
    {
        "companyName": "AgreeYa Solutions",
        "title": "Sr. Software Engineer",
        "location": "Atlanta, GA, USA",
        "description": "Greetings, Hope you are doing well! My name is Vishal Singh and I am Senior Recruiter with AgreeYa Solutions. AgreeYa is Most Promising Enterprise Software Technology Companies , feel free to check us out at www. agreeya. com. I came across your resume online and it looks like you have the skills and experience to be a successful in this role. Below is the job description as received by us from the client. If you would be interested to pursue this opportunity, please get in touch with me as soon possible. My Direct number is 916-673-1471. Title: Software Engineer IIILocation: Atlanta, GA 30328 (Hybrid)Duration: 12+ months Contract with potential extensionPay Rate: $53. 57/hour W2 Primary Responsibilities and Essential Functions:Advanced programming & scripting language skills (PHP, Python, Perl) debuggingDeep understanding of networking components and technologyDesign, deploy, configure, and manage virtualized computer resources within a server, storage, and networking environment. Set up software build and deployment environments while documenting processes. Define operating environment in OS, web services, databases, and scriptingDefine and build testing environments in server locations, networks, ancillary services, and data storageDatabase design and managementSecurity (access Control)Maintenance and periodic data clean upSQL and Postgres database management and queryingIdentification and deploy changes between release/deploymentsServer maintenanceOS release upgrade and patch application development and production server in out two datacenters. Support to our Network Operations Center and actively troubleshoot issues. Minimum:Bachelor's degree in a related discipline and 4 years' experience in a related field. The right candidate could also have a different combination, such as a master's degree and 2 years' experience; a Ph. D. and up to 1 year of experience; or 16 years' experience in a related field Must has experience with FreeBSD/UNIX, PHP, Python and Postgres, MySQL, User Interface design and development. Required:OS (FreeBSD, Debian Linux) variantWeb Services (Apache, Nginx, Node)Database (MySQL, Postgres)Scripting (PHP, Python, Perl)Frontend web designUser interface design and implementation AgreeYa is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, gender identity, sexual orientation, national origin, disability, veteran status or other protected characteristics. Visit our website to learn about our Career & Culture. For more information, visit www. agreeya. comSincerely yours, Vishal Singh (916) 673-1471 Direct vishal. singh@agreeya. comAgreeYa Solutions605 Coolidge Drive, Folsom, CA 95630www. agreeya. com",
        "requirements": ""
    },
    {
        "companyName": "King & Spalding",
        "title": "Manager Financial Analysis & Reporting",
        "location": "Atlanta, Fulton County, Georgia, USA",
        "description": "About the job: King & Spalding is a leading global law firm with a commitment to excellence, innovation, and the seamless delivery of legal services. We harness innovative technology and exceptional talent to meet the complex needs of our clients in a fast-paced and dynamic legal landscape. We are seeking a Manager of Financial Analysis & Reporting to join our Finance Department in Atlanta, New York, or Washington, D. C. Key ResponsibilitiesDeveloping, interpreting, and implementing timekeeper and client-focused financial models to support the firm's business goals and operating plans. Identifying and analyzing key performance measures, deaggregating metrics, and providing recommendations for improvement, assessing performance against key industry benchmarks, and assessing the impact of various performance improvement efforts. Regular interaction with partners and senior management, including communicating financial metrics and providing insights and recommendations. Work closely with other Finance functions, including Pricing, Billing, and Rate Management, on reporting needs and ad hoc requests for financial information and analysis. Provide senior management with analysis and reporting at client/matter, practice group, office, and timekeeper level. Provide support to other Business Operations teams, including Business Development, Lawyer Talent, and Recruiting. Partner with team leaders to understand their objectives and provide proactive support, analysis, and actionable insights. Work closely with the Financial Systems and IT teams on the development and enhancement of reporting tools, including dashboards and other dynamic reporting tools. Develop, monitor, and analyze key performance indicators for clients, matters, and practices. Identify and investigate trends, anomalies, and opportunities. Provide leadership, guidance, and mentorship to other members of the Financial Analysis team. Foster a collaborative and high-performance culture, promoting professional development and knowledge sharing. Develop presentations and concise analyses to communicate financial performance to senior leadership and management. Provide training to other team members on how to build models and interpret data. Establish and maintain team guidelines and standards to ensure timeliness, accuracy, consistency, and scalability of reporting. QualificationsBachelor's degree, with a concentration in Finance or Accounting preferred, as well as a minimum of 5 years of job-related experience, preferably in a law firm or professional services firm. Leadership skills and a proven ability to synthesize metrics into practical insights and communicate those insights confidently to stakeholders. Strong preference for candidates with experience managing and developing others. Candidates must have a high level of proficiency with Excel and consideration will be given to experience with SQL, PowerBI, and legal financial systems (Aderant or Elite). OtherAnalysis & Reporting will play a pivotal role in supporting the firm's business goals through reporting, modeling, and analyzing financial data. The firm offers a generous total compensation package with bonuses and raises awarded in recognition of individual merit-based performance. Eligible employees may participate in King & Spalding's comprehensive benefit program including health and wellness plan, life and disability insurance, flexible spending accounts and a health savings account, a 401(k) plan, profit sharing plan, discount programs, and a substantial Paid Time Off (PTO) program. Pay Transparency RangeNew York: full-time annualized salary range $145, 900 - 218, 900. Washington, D. C. full-time annualized salary range: $140, 000 - $210, 000. The salary offer will be contingent upon various factors, including but not limited to: relevant experience, internal equity, market data, job location, and other job-related factors permitted by law. Qualified candidates with arrest or conviction records will be considered for employment in accordance with the following laws if applicable: City of Los Angeles' Fair Chance Initiative for Hiring Ordinance, San Francisco Fair Chance Ordinance, the California Fair Chance Act. King & Spalding LLP (K&S) is committed to providing equal employment opportunity to all applicants and employees in full compliance with all state, federal, and local laws prohibiting discrimination on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, genetic information, age, disability or any other status protected by applicable law. We are proud of our remarkably cohesive culture, which now encompasses more than 2, 500 lawyers and business professionals worldwide. We seek to attract and develop the very best talent to work with us.",
        "requirements": ""
    },
    {
        "companyName": "House of Cheatham",
        "title": "Director of Business Intelligence",
        "location": "Atlanta, Fulton County, Georgia, USA",
        "description": "About the job: Position Overview:House of Cheatham, a renowned family-owned legacy company, is seeking a visionary Director of Business Intelligence to drive our data transformation journey. As a pivotal partner to the Executive Leadership Team, you will spearhead initiatives to leverage data for strategic decision-making, revenue growth, and operational excellence. Key Responsibilities:Business Reporting Insights Roadmap: Develop and implement a comprehensive strategy to transform the company into a data-driven organization. Enhance topline growth while ensuring robust bottom-line performance. Capability Assessment & Turnaround Strategy: Conduct a full-scale assessment of existing systems and reporting. Design and execute a turnaround strategy to consolidate reporting into a single source of truth, fostering revenue growth, margin expansion, and strong cash flow. Brand Portfolio Optimization: Analyze brand portfolios to identify key revenue generators, velocity contributors, and profitability drivers. Rationalize of SKU production to streamline sales, marketing, and operational efforts. Sales and Marketing Dashboards: Create advanced dashboards integrating real-time shipments, invoice sales, Syndicated, and POS data. Utilize these insights to define market indexing and identify opportunities for market strategies. Standard Operating Procedures for S&OP: Establish data-driven Standard Operating Procedures for Sales and Operations Planning (S&OP). Collaborate with cross-functional teams including Demand and Supply Planning, Procurement, master scheduling, plant operations, and finance to balance in-stock availability with customer demand. Production Capacity Modeling: Build and maintain a production capacity model based on Overall Equipment Effectiveness (OEE). Evaluate production capabilities against capital expenditure to optimize return on investment. Annual Operating Plan: Help develop the Annual Operating Plan by combining historical performance data with sales and marketing intelligence. Serve as the guiding framework for team objectives and performance targets. Operational Effectiveness: Enhance operational performance through real-time data visibility in production, scheduling, warehouse management, shipping, cost forecasting, and yield analysis. Qualifications:Proven experience in a senior business intelligence or analytics role, with a demonstrated track record of driving data-driven business transformations. Expertise in data analysis, dashboard creation, and operational reporting. Strong understanding of Sales and Operations Planning (S&OP) processes and best practices. Experience with production capacity modeling and financial forecasting. Exceptional leadership skills with the ability to influence and collaborate with executive teams. -Advanced proficiency in business intelligence tools and data visualization platforms.",
        "requirements": ""
    },
    {
        "companyName": "Restaurant365",
        "title": "Director, Business Intelligence",
        "location": "USA",
        "description": "About the job: Restaurant365 is a SaaS company disrupting the restaurant industry! Our cloud-based platform provides a unique, centralized solution for accounting and back-office operations for restaurants. Restaurant365's culture is focused on empowering team members to produce top-notch results while elevating their skills. We're constantly evolving and improving to make sure we are and always will be “Best in Class” . . . and we want that for you too! How you'll add value: People ManagementManage the Business Intelligence team to provide priorities, scope, and timelines, overseeing quality of work, goal setting and performance reviews. Mentor and train members of the team in data analysis, visualization, and SQL best practices. Data Product ManagementCollaborate with executives, business leaders, and cross-functional teams to understand their data needs and strategic objectives. Translate data needs and strategic objectives into technical requirements for exploratory data analyses, data products, or data infrastructure. Create documentation for reference, process, and results. Establish process to receive feedback on implemented projects to ensure the anticipated value creation is achieved. Drive the concept of data as a product by applying product thinking into datasets. Stay up to date with industry trends and emerging technologies in business intelligence and evaluate their potential impact on the business. Project ManagementWork with the Enterprise Technology & Data leadership team to translate data needs and strategic objectives into a larger Insights roadmap, which includes Data Engineering and Data Science. Create project plans for larger initiatives. Lead multiple large scale, high impact projects that are transformational for users. Manage the Insights Agile scrum team and ideally the Enterprise Data Warehouse Agile scrum team. Deliver and report on quarterly OKRs. Stakeholder EngagementAct as a trusted advisor, guiding how data can be leveraged to achieve business outcomes. Establish SLAs, metrics, objectives and success criteria for the team and guide the team in achieving business needs. Establish and nurture strong stakeholder relationship built on trust, delivery, and support. Communicates complex ideas and concepts to non-technical peers and customers. Other duties as assigned, including hands-on technical work as needed to support the team in hitting deadlines. What you'll need to be successful in this role: 8+ years of formal people manager experience. SaaS industry experience required. Strong working experience with Data Engineering or Analytics Engineering teams; Data Science is a plus. Exemplary analytical problem-solving skills, and knowledge of business intelligence tools (I. e. Domo, Looker, Tableau). Advanced knowledge of SQL; Python a strongly preferred. Familiarity with a Modern Data Stack (I. e. ETL tools like dbt, Airflow, Fivetran and cloud data warehouses like BigQuery, Snowflake, Azure, or Redshift). Excellent communication and collaboration skills, with the ability to influence stakeholders at all levels of the organization. Strong attention to detail and excellent written/verbal communication skills. Intrinsically motivated to achieve goals, deliver on tasks without reminders, and be very responsive in a remote environment. Occasional travel may be required. R365 Team Member Benefits & CompensationThis position has a salary range up to $190k - $220k/year. The above range represents the expected salary range for this position. The actual salary may vary based upon several factors, including, but not limited to, relevant skills/experience, time in the role, business line, and geographic location. Restaurant365 focuses on equitable pay for our team and aims for transparency with our pay practices. Comprehensive medical benefits, 100% paid for employee401k + matchingEquity Option GrantUnlimited PTO + Company holidaysWellness initiativesR365 is an Equal Opportunity Employer and we encourage all forward-thinkers who embrace change and possess a positive attitude to apply.",
        "requirements": ""
    },
    {
        "companyName": "ServiceChannel",
        "title": "VP, Global Engineering",
        "location": "USA",
        "description": "About the job: As the Vice President of Global Engineering, you will report to the Chief Product and Technology Officer and lead our talented Engineering, DevOps, and Data teams to drive the creation and delivery of our industry-leading products. This role is both strategic and operational, requiring a dynamic leader who can collaborate with cross-functional teams, innovate within the product development lifecycle, and ensure that our engineering practices propel us to meet our global market demands. Key ResponsibilitiesLead and scale the global engineering team, fostering a culture of technical excellence, collaboration, and innovation. Collaborate with the Chief of Product and Technology Officer as well as other leaders to align engineering strategies with company objectives. Collaborate with product management to define product requirements and ensure that the engineering team has clear direction and priorities. Drive the development and execution of engineering roadmaps, ensuring timely delivery of high-quality software solutions. Foster an environment of continuous improvement by implementing best practices in engineering methodologies, including Agile and DevOps. Champion the adoption of cutting-edge technologies and processes to maintain our competitive edge. Oversee the architecture and technical design of our products, ensuring scalability, reliability, and security. Establish and monitor KPIs to measure the effectiveness of engineering processes and outcomes. Manage budgets, forecasting, and resource allocation to optimize productivity and efficiency. Serve as a technical and business mentor, providing guidance and leadership development to engineering managers and team leads. Represent the engineering team in executive meetings and contribute to strategic planning for the company. Required Skills & ExperienceBachelor's or Master's degree in Computer Science, Engineering, or a related technical field. 15+ years of engineering experience, with at least 7 years in a senior leadership role managing global teams. Proven track record of leading large-scale software development projects and delivering complex systems with high customer impact. Strong technical acumen with experience in software architecture and cloud technologies. Excellent leadership and people management skills, with the ability to inspire, motivate, and mentor a diverse team. Experience with Agile methodologies and a strong understanding of product lifecycle management. Exceptional communication and interpersonal skills, with the ability to navigate complex cross-functional environments. Strategic thinker with an analytical mindset and problem-solving prowess. Hands-on experience as a developer/engineer is a plusExperience in the facility management or service industry is a plus. Fortive Corporation OverviewFortive's essential technology makes the world stronger, safer, and smarter. We accelerate transformation across a broad range of applications including environmental, health and safety compliance, industrial condition monitoring, next-generation product design, and healthcare safety solutions. We are a global industrial technology innovator with a startup spirit. Our forward-looking companies lead the way in software-powered workflow solutions, data-driven intelligence, AI-powered automation, and other disruptive technologies. We're a force for progress, working alongside our customers and partners to solve challenges on a global scale, from workplace safety in the most demanding conditions to groundbreaking sustainability solutions. We are a diverse team 18, 000 strong, united by a dynamic, inclusive culture and energized by limitless learning and growth. We use the proven Fortive Business System (FBS) to accelerate our positive impact. At Fortive, we believe in you. We believe in your potential-your ability to learn, grow, and make a difference. At Fortive, we believe in us. We believe in the power of people working together to solve problems no one could solve alone. Fortive: For you, for us, for growth. ServiceChannel empowers many of your favorite brands to take care of their brick and mortar locations. Our customers are market leaders in the retail, restaurant, grocery, convenience store, fitness, banking, education and health industries. The facilities and store operations teams at CVS, Trader Joe's, Adidas, Louis Vuitton and Chipotle, among 500 other brands in over 70+ countries, rely on us to deliver the best possible guest and employee experience. We are the leader in our space, and we continue to earn that position by driving innovation around IOT, AI and data with our software and services. In 2021, we joined the Fortive family of leading technology companies, united by a common purpose to make the world stronger, safer and smarter. Fortive is a Fortune 500 company and has been named by Fortune as one of the world's most admired companies. Being part of Fortive means we are supported by a strong foundation of business systems, resources and culture, which will accelerate our growth journey! We offer an excellent benefits package including medical, dental, vision, life and LTD insurance, HSA, and a 401(k) retirement plan. “We Are an Equal Opportunity Employer. Fortive Corporation and all Fortive Companies are proud to be equal opportunity employers. We value and encourage diversity and solicit applications from all qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity or expression, or other characteristics protected by law. Fortive and all Fortive Companies are also committed to providing reasonable accommodations for applicants with disabilities. Individuals who need a reasonable accommodation because of a disability for any part of the employment application process, please contact us at applyassistance@fortive. com. “This position is also eligible for bonus and equity as part of the total compensation package. The salary range for this position (in local currency) is 164, 500. 00 - 305, 500. 00",
        "requirements": ""
    },
    {
        "companyName": "Loop Returns",
        "title": "Director of Data",
        "location": "USA",
        "description": "About the job: Loop is in an unparalleled position to provide data to our merchants that no one else is able to replicate. Data will be at the core of everything we do and some of our most critical work as we grow. Our future is to create data-based products that use modern techniques for delivering not only data, but also invaluable insights. We'll identify problems our merchants don't even know they have and use our data to create solutions that thrill merchants with their ability to predict and forecast their customer's needs. As the Director of Data , you'll lead a talented team of data professionals to develop and scale data products that provide critical insights for our merchants. You'll set the vision for our data strategy, ensuring collaboration across teams to drive impactful, data-driven decisions at Loop. But the impact you'll have doesn't stop there! By reporting through Product, this will allow you to be part of the Product leadership team and contribute to overall product strategy and vision. Right away, we've listed what we think you'll be spending your time on. We're growing fast, and growth means the challenges we'll work on together will change as we lead Loop through new and different phases. This is an indispensable role with us, so we'll be looking for you to have examples of when you've tackled these challenges throughout your career. We've laid out the experience we think is important to set you up for success in this role. But, we appreciate that different humans will solve problems in different ways, so we don't expect you to fit exactly in a box of requirements. At Loop, we believe that flexibility and choice are what allow you to do your best work. With our Blended Working Environment, you have options ranging from joining our HQ office (in Columbus, Ohio), opting into a Hub (a location with 4+ team members), or staying totally secluded (our version of remote). Our team is spread across the United States, select provinces in Canada (Ontario & British Columbia), and the United Kingdom. Wherever you live, you can create the work environment that best matches your preferences and lifestyle. What You'll Do: Harness the unique power and scale of Loop's data from thousands of merchants (including Shopify's largest and most influential brands) and their customers and transactions to transform Data at Loop from being a supporting and serving function to one that is invaluable to the service of customers and the development of our products. Ensure Loop is set up for success to provide insights and analysis to customers and internal Loop employees while creating unique value and monetization opportunities with data products. To accomplish this, you will create and maintain the overall data roadmap, which balances internal and external stakeholder needs. Set the vision and direction for data strategy and architecture, ensuring that we are planning, building and scaling for the future. Initiate innovative efforts to mature our tools, systems, and processes to accomplish this future. Serve as part of the Product leadership team, reporting to the SVP of Product. You will contribute to the product strategy and vision, ensuring that data is used to make decisions and create unparalleled value. You effectively communicate up, down, and across to ensure executives, stakeholders, peers and your team understand the priorities of the business, the priorities of the data team and how to best deliver against those priorities together. You are a champion and are able to gain the trust and buy-in of cross-functional stakeholders, leaders and your team. Oversee the adoption and utilization of our data collection and data visualization tools. We're currently using Snowflake, Fivetran, Monte Carlo, dbt, Hex, Secoda, along with other native capabilities of AWS. You'll be leading a well-established and impactful team of data analysts, analytics engineers, data engineers, and machine learning engineers. You will enable them to grow and effectively collaborate with teams to build products that solve crucial business problems. You'll also partner with the People team to hire awesome, incredibly talented data experts and structure the team in a way that most effectively delivers results. Elevate the culture at Loop by demonstrating behaviors that are important to delivery while staying aligned with our core values. This includes a bias for action and leading by example to motivate, support and make team members better. We're an early stage company, you'll wear many hats in this role and be responsible for owning both strategy and execution. Your Experience:7+ years of data experience. 5+ years of experience leading modern data teams. 5+ years experience building and monetizing data products. Having experience in the commerce space is very important to us, and is required for this role. You've also worked at a startup company (or a few) and know what it means to make it through the various stages of rapid growth. You have demonstrable experience building collaborative processes between data, engineering, and product teams to solve critical business problems with data products. Demonstrated experience and familiarity with shipping analytics/ML-based products to live production environments using cloud computing platforms such as AWS, GCP, Azure, etc. You're a champion of data, and can share some examples with us of how you've driven key business results by enabling the use of data in your organizations. You have examples to share of how you've successfully influenced and managed broad stakeholder priorities. You have also created exceptional partnerships with your internal partners, and quickly became one of their favorite people to work with. Hands-on experience with SQL, ETL, Python, R, or Software Development is highly desirable and imperative to being successful in this role. Have an attitude that truly nothing is “not your job. ” You should feel excited by the need to act like an owner to solve problems and dig in, wherever needed. $196, 800 - $295, 200 a yearWe know that making decisions about your career and compensation is a huge deal. Because of that, we're incredibly thoughtful about our compensation strategy. We want you to feel safe and excited, but also comfortable with the compensation package of a startup. We've outlined some important information for you here, but please know there's a lot more to compensation than we can cover in this job posting. The posted salary range is the base salary for this opportunity. The salary range is subject to change, and may be adjusted in the future. The actual annual salary paid for this position will be based on several factors, including, but not limited to: your prior experience and skills related to the position, geographic location, company needs, current market demands, and your total compensation goals. This position is also eligible for an annual performance bonus expected to be 15% of your base salary. Great humans deserve great benefits! At Loop, you'll be eligible for benefits such as: medical, dental, and vision insurance, flexible PTO, company holidays, sick & safe leave, parental leave, 401k, monthly wellness benefit, home workstation benefit, phone/internet benefit, and equity. Loop StoryIn a perfect world, Loop wouldn't exist. If we had our way, we'd live in a world where we're mindful about how we consume, we love every product we own, and we share values with the brands who create them. In reality, commerce isn't perfect and often breaks. Loop creates second chances. We're starting by revolutionizing the post-purchase experience. We've taken one of the most fragile commerce interactions - returns - and turned it into something consumers actually love, and that deepens our connection to brands and products. We take connection seriously on the inside, too. We're building a work experience that allows you to Be A Human First and prioritizes empathy and wellbeing. We view Loop as a special place in your career to shape the future of an industry and become a better person while doing it. You can grow faste r here in a shorter amount of time - we'll give you space and trust you to fill it. Learn more about us here: https://loopreturns. com/careers . You can review our privacy notice here .",
        "requirements": ""
    },
    {
        "companyName": "Talkiatry",
        "title": "Business Intelligence Manager",
        "location": "USA",
        "description": "About the job: We are looking for a Business Intelligence Manager to join our growing team. In this role, you will lead the charge in building and maintaining a series of world-class data products, including an entire data model repo, self-service tools, and other data assets. Collectively, you and your team will leverage these to empower teams across the organization to make data-driven decisions that drive business success and improve patient care. You will work closely with engineering, product, clinicians, and internal stakeholders. About Talkiatry:Talkiatry transforms psychiatry with accessible, human, and responsible care. We're a national mental health practice co-founded by a patient and a triple-board-certified psychiatrist to solve the problems both groups face in accessing and providing the highest quality treatment. 60% of adults in the U. S. with a diagnosable mental illness go untreated every year because care is inaccessible, while 45% of clinicians are out of network with insurers because reimbursement rates are low, and paperwork is unduly burdensome. With innovative technology and a human-centered philosophy, we provide patients with the care they need-and allow psychiatrists to focus on why they got into medicine. You will:Manage a team of BI professionals, providing mentorship and support to foster a high-performance culture. Set clear expectations, establish best practices, and ensure continuous growth and development within your team. Contribute to the development of data enablement strategy to align with Talkiatry's business goals, including optimizing patient care, improving operational efficiency, and supporting data-driven decision-making across all departments. Manage a team of BI engineers responsible for the end-to-end development of our data model repo and all user-facing data products, including our BI solution. Lead efforts to design and implement data models that empower stakeholders to easily access and analyze data. Work closely with data engineering, product management, and business stakeholders to identify BI needs, prioritize projects, and deliver data products that drive business impact. Support experiment reviews and help establish experimentation best practicesGuide your team to complete high impact analyses that uncover opportunities our patient-facing, provider-facing, or operations-facing products to drive our business forward. Establish and maintain data governance standards and best practices to ensure data integrity, accuracy, and compliance with healthcare regulations. You have:6+ years of experience in Business Intelligence, Analytics, or related fields, with at least 3 years of experience managing and leading BI teams. Proven track record of managing large, complex analytics projects from inception to delivery, with the ability to balance people management and individual contributor responsibilities. Extensive experience with BI tools (e. g. , Looker, Tableau, Power BI), cloud data warehouses (e. g. , Snowflake, Redshift), and data transformation tools (e. g. , DBT, Airflow). Strong expertise in SQL and data modeling is essential. Experience in managing data quality initiatives, monitoring, and auditing. Experience working with product leaders to identify high impact opportunities. Experience analyzing A/B tests and supporting products teams in measuring and hitting their goalsA strong analytical mindset, with the ability to break down complex data into meaningful insights that drive strategic decision-making. Strong interpersonal skills with the ability to work across teams. Why Talkiatry:Top-notch team: we're a diverse, experienced group motivated to make a difference in mental health careCollaborative environment: be part of building something from the ground up at a fast-paced startupFlexible location: work where you want to, either remotely across the U. S. or from our HQ in NYCExcellent benefits: medical, dental, vision, effective day 1 of employment, 401K with match, generous PTO plus paid holidays, paid parental leave, and more! Grow your career with us: hone your skills and build new ones with our Learning team as Talkiatry expandsIt all comes back to care: we're a mental health company, and we put our team's well-being firstCompensation range for this position is $190K - $230K + equity, depending on experience; actual compensation will be dependent upon the specific role, location, as well as the individual's qualifications, experience, skills and certifications. Talkiatry participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U. S. only after a job offer is accepted and Form I-9 is completed. For more information on E-Verify, please visit the following: EVerify Participation & IER Right to Work. At Talkiatry, we are an equal opportunity employer committed to a diverse, inclusive, and equitable workplace and candidate experience. We strive to create an environment where everyone has a sense of belonging and purpose, and where we learn from the unique experiences of those around us. We encourage all qualified candidates to apply regardless of race, color, ancestry, religion, national origin, sexual orientation, age, citizenship, marital or family status, disability, gender, gender identity or expression, pregnancy or caregiver status, veteran status, or any other legally protected status.",
        "requirements": ""
    },
    {
        "companyName": "Aqua Finance",
        "title": "Director, Reporting & Analytics",
        "location": "USA",
        "description": "About the job: Director, Reporting and AnalyticsThe Director of Reporting and Analytics for Account Servicing is responsible for leading the strategy, development, and execution of data analytics and reporting functions to support the department's objectives. This role oversees data-driven initiatives across key functions, including Collections & Recovery, Complaint Management, Account Administration, and Customer Experience, ensuring that insights align with strategic goals. The Director will manage a team, including at least one direct report, to provide actionable reporting, improve operational performance, and drive informed decision-making. This role reports to the VP, Servicing Operations. Essential Functions Develop and execute a reporting and analytics strategy to support the goals of the Account Servicing department. Oversee the creation and maintenance of performance dashboards, operational reports, and predictive analytics to inform strategic and tactical decision-making. Collaborate with leaders across Collections & Recovery, Complaint Management, Account Administration, and Customer Experience to identify key performance indicators (KPIs) and deliver insights tailored to their needs. Manage and mentor a team of analysts, ensuring high-quality deliverables, fostering professional growth, and driving a culture of continuous improvement. Lead the development and implementation of data models and tools to improve data accessibility, usability, and accuracy. Perform advanced data analysis to identify trends, root causes, and opportunities for operational enhancements, presenting findings to senior leadership. Partner with IT and other departments to ensure data systems, processes, and governance meet current and future business requirements. Establish and maintain best practices for data governance, ensuring compliance wit h regulatory requirements and internal policies. Drive initiatives to enhance reporting efficiency and automate manual processes where possible. Provide thought leadership on emerging analytics technologies and trends to advance the organization's capabilities. Required Education and ExperienceBachelor's degree in Data Science, Statistics, Business Analytics, or a related field, or commensurate work experience required7 years of experience in data analysis, reporting, and analytics in increasingly elevated roles required3 years of people management experience requiredProficiency in data visualization tools (e. g. , Tableau, Power BI) and advanced data querying using SQL or similar tools. Demonstrated experience delivering actionable insights to senior leadership and influencing decision-making. Strong project management skills, with the ability to lead cross-functional initiatives. Experience in a contact center or Account Servicing environment, particularly in Collections, Recovery, or Complaint Management preferred. Knowledge of predictive analytics, machine learning, or statistical modeling. Familiarity with regulatory requirements and data governance best practices in financial services. Proficiency in advanced analytics tools (e. g. , Python, R, SAS). Financial industry experience preferredAttention to detail and accuracy requiredExcellent verbal and written communication skills requiredProficient in the utilization of Microsoft Office SuiteAbility to thrive in a fast-paced work environmentPhysical DemandsWhile performing the duties of this job, the employee is frequently required to sit, stand, walk, visualize, talk, hear, and handle or touch objects or controls. The employee may occasionally lift, push, or pull up to 20 pounds. This position is an office-based position where you must be able to sit for long periods of time. The employee will be working on a computer 90% of the time.",
        "requirements": ""
    },
    {
        "companyName": "Circle K",
        "title": "Head of Global Engineering and BI",
        "location": "Charlotte, Mecklenburg County, North Carolina, USA",
        "description": "About the job: Head of Global Data Engineering and BIJob Description SummaryMaybe you've stopped by for a coffee, fueled up your car or grabbed something to eat on the go. Then you know Circle K is all about making everyday life easier for people all over the world. We are a Global Fortune 200 company and have grown into a successful global business with over 15, 000 stores in twenty-four countries, serving more than six million customers each day. In all, we have more than 120, 000 people working at our stores and support offices. To support our journey to become a data driven organization, we are transforming our data platform and processes to enable an agile delivery model, maximize reusability, and leverage automation to improve our delivery quality and speed to market. We are looking for a dynamic leader to lead our Global Data Engineering and BI team and to lead the data platform transformation. For the right candidate, Circle K can offer a challenging and rewarding role working with a talented, global team. In this role you will own the delivery of data products and solutions for various strategic initiatives, including Global Merchandising Excellence (pricing, assortments, promotions), Global Fuels (pricing), Global Loyalty, Supply Chain (merch COGS), Finance, Real Estate (analog & whitespace), B2C / B2B (payment transactions analytics), Operations (shrink and sales analytics), etc. The Head of Global Data Engineering and BI will report to the VP of Global Tech Enterprise, Data and Retail Technologies within Circle K and lead a global team of approximately fifty employees (including open positions) and seventy-five contractors. This role will be a key contributor to driving company performance through achieving Circle K's data analytics strategy and fostering a data driven culture across the organization. This position will be based out of Tempe, Arizona or Charlotte, North Carolina and covers all business units and countries where Circle K operates. The role will require a high degree of collaboration across all business functions including the Global Technology and Global Data & Analytics teams. It will involve evangelizing effective data management practices, determining how to best leverage relevant existing and emerging technologies, and promoting better understanding and utilization of data and analytics at Circle K. Working with key functional partners and stakeholders, internal technical subject-matter experts, suppliers, and industry experts having the right data, avoiding data bias by including data from varied sources, ensuring the fitness for use and quality of the data and providing the mechanisms to share/leverage common data solutions across CircleK. In this role, the Head of Global Data Engineering and BI, manages and controls:Logical and physical corporate data warehouse and data marts for specific business areas to minimize data redundancySpecific analytics and business intelligence (BI) platforms and tools to share and leverage analytic insights across the companyThe investigation and application of relevant emerging technology in the Data and Analytics domain, including GenAIA large focus of this role is to lead the team responsible for building, managing and optimizing the enterprise data supply chain for key data and analytics consumers (e. g. , business & data analysts, data scientists, etc. ) to drive business value. The team will ensure data pipelines, models and algorithms are optimized for data integrity, performance, security, and governance. ResponsibilitiesJob DescriptionBuilding and maintaining the data supply chain: The primary responsibility of this role will be to lead a team that architects, builds and manages the Company's data supply chain. This will entail ingestion of both existing and future-state data sources to be determined based on business needsBeing a data and analytics evangelist: This role will promote the available data and analytics capabilities and expertise to functional heads and business unit leaders and educate them in how to best leverage these capabilities in achieving their business goals. In addition, this role will bring relevant leading-edge technology into the solution set for driving business value more quickly. Collaborate across functions: The leader will require strong collaboration skills to work with varied stakeholders within the organization. Work in close relationship with cross-functional leaders to scope and prioritize initiatives. Manage the technology for the data ecosystem: Build, integrate, and maintain enterprise data & analytics technologies for: data ingestion; brokering and integration; data warehouse / lake; data marts; and reporting, visualization, and other business intelligence tools. Review and enhance development standards and best practices: Ensure repeatable and scalable solutions to deliver high quality data products and solutions to the enterprise (e. g. , Dev Ops, CI/CD, data quality automations, peer code reviews, knowledge sharing, support model, etc. )QualificationsThe Head of Global Data Engineering and BI must have considerable experience with data management and analytics processes and technology. In addition, we expect:A bachelor's or master's degree in computer science, data science, business analytics, statistics, applied mathematics, information systems, information science or a related quantitative field (or equivalent work experience) required. Strong experience and knowledge in retail industry preferredAt least ten years of experience in data analytics leadership roles, managing data engineering and BI teams to deliver global enterprise data solutions using Data Lake, Data Warehousing and Business Intelligence capabilities. Experience in managing large, globally distributed teamsAt least 5 years of experience hiring and mentoring high caliber, data focused engineers with diverse technical strengths and backgroundDeep experience with data engineering, big data and analytical technologies using cloud-based data platformsExpert in guiding the organization to make data-driven decisions by providing clear, concise, and accurate data insightsA track record of identifying relevant leading-edge technology and achieving benefits of early adoption. Strong supplier management, negotiation, and commercial skills. Strong financial skills to effectively manage the operational and project budgets (including forecasts and to provide resourcing cost estimates to support new demandsExperience in integrating complex, cross-functional processes, and data models. Broad experience in multiple domain areas including data warehousing; business intelligence (BI); data architecture; data integration; data engineering, data classification; data strategy; data quality management; and enterprise architecture framework. Required technical skills and experience:Advanced Data Engineering: expert in data mesh reference architecture, data modeling, developing, and optimizing ETL (Extract, Transform & Load) processes and data pipeline development. Experience with Azure Data Factory, Apache Airflow, and various data ingestion methods (batch, streaming, API, enterprise hub) required. Data Warehousing: strong understanding of data warehousing concepts, practices, and tools such as SnowFlakeConsumption Tools: good understanding of BI tools such as Tableau, PowerBI, Qualtrics, etc. Cloud Platforms: strong experience with Microsoft Azure, AWS and Google Cloud and their data services (Azure Synapse, Redshift, BigQuery)Data Governance and Security: Familiarity with data privacy laws, regulatory compliance, ethics of data use, and data security best practicesAI /ML Platforms: strong experience with DataBricksAdvanced Analytics Tools: Experience with R, Python, Java, C++, Scala, etc. Common Database Programming Languages: Experience with SQL, MongoDB, and CassandraExperience in working with large, heterogeneous datasetsExperience with Data science and machine learning models and algorithmsExperience with Automation tools such as Trifacta, Paxata, etc. Experience with Agile and Scrum development, preferably with SaFe AgileKnowledge/SkillsStrong, results-driven personality with a high level of enthusiasm, energy and confidenceDemonstrated leadership; proven track record of leading complex, new endeavors and delivering solutions. A sense of urgency with a demonstrated commitment to high ethical standards, comfort with regulatory compliance, customer service and business integrityAbility to work with ambiguity as the organization continues to evolveStrong leadership skills to move the team through a major change, initiative to drive change forward and identify solutions to potential obstaclesEffective communication and relationship-building skills to work collaboratively with Operational Business Units, Global Functions and Global Tech stakeholdersAbility to share information across business functions and disciplines; manage stakeholders with diverse interests; make actionable recommendationsExcellent communication, organizational and presentation skillsExcellent interpersonal skills: able to work across business lines at senior levels to influence and effect change to achieve common goalsAbility to effectively drive people, process, and technology change in a dynamic and complex operating environmentDemonstrated ability to work as part of a global team, including understanding how to navigate cultural differences in workstyles and communicationsStrong people management skills to help develop team members in the competency-based org structureStrong analytical skills to derive actionable insights from complex datasetsAbility to diagnose data-related issues and implement effective solutionsDevelop solutions which focus on how to successfully extract insight from big dataKeen understanding of business objectives and ability to apply this understanding to recommend practical solutionsStrategic technology planning and execution experience, policy development and maintenanceEffectively communicate in English, in both written and oral formsCircle K is an Equal Opportunity Employer. The Company complies with the Americans with Disabilities Act (the ADA) and all state and local disability laws. Applicants with disabilities may be entitled to a reasonable accommodation under the terms of the ADA and certain state or local laws as long as it does not impose an undue hardship on the Company. Please inform the Company's Human Resources Representative if you need assistance completing any forms or to otherwise participate in the application process. Click below to review information about our company's use of the federal E-Verify program to check work eligibility:In EnglishIn Spanish",
        "requirements": ""
    },
    {
        "companyName": "Rho",
        "title": "Senior Director, Data Management",
        "location": "USA",
        "description": "About the job: Join us in redefining what it means to work for a CRO. Working at Rho, you'll be joining a team who take healthcare and clinical research personally, with shared experiences that drive a passion to heal, cure and solve some of humanity's biggest challenges. At Rho, we're committed to you just as you're committed to us. You'll have the opportunity to experience a thriving company with real stability - financial, workforce, and corporate, which has created a safe environment to innovate and develop over a long and rewarding career. With a collaborative team of smart, talented, and positive people, you'll be celebrated and respected for your expertise and given the freedom to think creatively, challenge the norm, and problem-solve. We are currently hiring a Senior Director, Data Management, to join our team! The Senior Director of Data Management will provide overall strategic and tactical leadership to Rho's Data Management team. This role will support DM sales in both integrated services and stand-alone advisory bids, ensure timely deliverables of the highest quality, facilitate shared learning and knowledge retention, and provide solutions to resolve problems while improving efficiency within the team. This role also oversees staff performance management, talent development, and ensures all are trained and compliant with current SOPs. This role provides operational guidance and serves as a mentor to develop staff. In addition to serving in a management role for Rho data management staff, the Director of Data Management will also oversee studies - attend client meetings, provide strategic project planning, and allocate study resourcing . The Director of Data Management is just as comfortable advising study leaders on standards-compliant approaches to EDC database design as overseeing study data collection in a pivotal trial, ensuring error-free operation and support for biostatistic s and safety case reporting. The Director of Data Management will also be responsible for leading and engaging in departmental and cross functional initiatives. Our Data Management Team will tell you, joining Rho has been one of their best career moves in terms of contentment, financial rewards and career growth, which is why we have such stability in the group! ResponsibilitiesManagement of the Data Management DepartmentParticipate in cross functional-area leadership teams representing Data Management. Serve as overall manager of Data Management, setting priorities and goals, and reporting to management on pr ogress toward goals and overall department performance . This includes personnel development, projections, gaps and potential needs, highlighting key areas of accomplishments, metrics and risksCollaborate with project teams and functional area SMEs across the business, to ensure customer satisfaction, high quality deliverables, and profitability of studiesParticipate in special assignments, process assessments and development of project aids such as standards, templates, guidances , etc. Design cross-functional process efficiencies and develop new approaches to data managementStay current on data management and industry trends and how these may impact development and data management approachesParticipate in quality efforts for continuous improvement by assuring quality metrics are in line with company, client and data management objectives ; participate in defining strategies for new processes and technology; Identify efficiencies and trends across studies; provide advice and solutions to solve problems and improve efficiency across functions, projects and customers. Ensure shared learning and knowledge retention within departmentPa rtner wit h BD to pa rticipate in propos al devel opment, cl ient pres entations and/ or bid defen se meetings as neede dParticipate in BD staffing strategy to provide input on staffing assignments balancing business and project needs; assess data management strategies and resources to support budget development Management responsibilities for Clinical Data Associates and Clinical Data ManagersEnsure that data management deliverables are on time, on budget, and error freeMeet regularly with employees to provide mentorship and discuss development and performanceMaintain retrospective and prospective vigilance of utilization , realization, availability to take on additional work and paid time offProvide mentorship in all aspects of data managementCollaborate with the Organizational Development team to manage, plan, create, and present learning and training opportunities for current and future data management staffProvide data management training by implementing effective orientation, mentoring, and career development opportunitiesEnsure staff fulfill their responsibilities in accordance with policies, procedures, SOPs, ICH-GCPs, and country specific regulatory requirements; ensure staff compliance with assigned trainings Management responsibilities for studiesAssess staff resources, projections and activities to ensure that project teams meet client expectations and contractual obligations with high qualityServe as escalation point and technical expert for clients as neededServe as a customer-facing expert on globally-accepted data management standards, including ICH E2; M1 MedDRA Terminology; ICH M5, Data Elements and Standards for Drug Dictionaries; the WHO Drug Dictionary; clinical data management guidelines such as the C-DISC standards; and other applicable US and EU standards QualificationsMinimum of twelve years data management experience , includingA t least five years ' experience managing staff ;At least five years' experience representing DM in cross-functional study teams ;Demonstrated experience representing DM with external partners (e. g. , sponsor, CRO, regulator);Serving as lead DM on stud ies conducted in the US and at least two other countries ;Representing DM in the sales process. Deep experience in DM standards and technology, includingDemonstrated e xperience with Medidata Rave; experience with additional EDC platforms is a plus;Understanding of computer data and data structures;Demonstrated e xperience with EDC, RTSM, ePRO from database development to close-out;Fluency with international DM standards and able to lead a discussion on their implementationStrong understanding of project staffing and typical data management team structuresSolid understanding of staff and study managementC lear understanding of the drug development processAbility to establish and maintain effective working relationships with coworkers, managers and clientsDemonstrates effective , systematic decision-making skillsExperience developing and mentoring staffProven ability to balance competing priorities; ability to see patterns in issues, discount non-issues and prioritize to make progressProactive and effective communicatorAbility to identify issues within a project and lead the team to resolutionA subject matter expert in data managementStrategic thinker and active problem-solver A Few More Things To Know About UsBenefits: Rho provides a comprehensive benefits package for all benefit-eligible employees, which includes medical, vision, dental, HSA, FSA, EAP, life & disability insurance and 401(k). All employees are eligible for paid time off, holidays, parental leave and bereavement leave. Diversity and Inclusion: As a global, full-service CRO driven by our collective experiences, we view each of our backgrounds as a vital component in our formula for success and we strive towards building a more equitable, inclusive, and diverse environment for our employees every day. By valuing and tapping into each employee's unique and different personal experiences, we are able to uplift employee dignity and belonging, foster more strategic creativity, and more quickly arrive at breakthrough solutions that help us heal the world. Flexibility: We encourage a work-life balance that allows employees to bring their best selves to work while being passionate about their lives outside work. EOE. Veterans/Disabled#DataManagement#Biometrics",
        "requirements": ""
    },
    {
        "companyName": "SharkNinja",
        "title": "Director, Data Science & Analytics - Amazon",
        "location": "USA",
        "description": "About the job: Our purpose is to positively impact people's lives every day in every home around the world! We work very hard to provide our consumers with high-quality, exciting 5-star products that make life easier. We thrive on passion and innovation and are looking for great people, with great ideas, who want to build the next big thing and develop while they do. Job Description:We are seeking a dynamic Director, Data Science & Analytics (Amazon) to join our team. The primary responsibility is to serve as the \"Chief Amazon Marketplace Explorer, \" continuously testing to uncover breakthroughs in all cross-functional capabilities utilizing technology and data. The ideal Director, Data Science & Analytics (Amazon) has an insatiable desire to create breakthrough strategies with the experience to own our data tech stack and global reporting & analytic best practice. As such, this position will manage a team that builds and maintains our executive global data and reporting. The successful Director, Data Science & Analytics will possess a deep understanding of the Amazon ecosystem, exceptional analytical skills, and a passion for identifying new opportunities that drive business growth. This role will sit on the Amazon Leadership team and must be able to support varying data sets across finance, operations, sales and marketing among others. Key Responsibilities:Serve as the Chief Amazon Explorer, creating a learning agenda to identify, test, iterate and scale innovative strategies and opportunities on Amazon. Leverage technology and data analytics to uncover hidden insights and drive action across sales, marketing, logistics, and customer service. Assess current technology partners and solutions to maximize utilization & pressure for incremental value (AMC, Digital Shelf Tools, Revenue Recovery, Content Optimization, Catalog Management etc. )Collaborate with internal teams to implement and optimize Amazon-specific strategies based on findings. Stay updated with trends, tools, and technologies within the Amazon marketplace to ensure competitiveness. Develop and maintain reports and dashboards using tools like Tableau and Power BI to track performance metrics and present findings to senior leadership. Identify opportunities to increase process automation and integrate AI/ML into practice. Conduct market research and competitive analysis to inform strategic decisions and identify new growth opportunities. Utilize advanced data analytics, including predictive modeling, statistical analysis, data mining, and machine learning, to drive decision-making and improve Amazon marketplace strategies. Manage a team responsible for building and maintaining the company's Amazon data and reporting strategy while tackling internal projectsOversee the creation and maintenance of a Global Amazon Reporting Center of Excellence. Participate in the Amazon Leadership team, contributing to strategic decision-making and overseeing global responsibilities. Your Role within the Team:Foster a data-driven culture, leveraging data analytics for informed decision-making. Provide strategic insights from data analytics, identifying trends and opportunities to support business decisions. Develop forward-looking data strategies to create new competitive advantages. Ensure data integrity, security, and compliance with relevant regulations. Lead and mentor a team of data professionals. Duties and Responsibilities:Develop and execute the data analytics strategy to support company objectives. Drive advanced analytics initiatives, including predictive modeling, statistical analysis, data mining, and machine learning. Establish KPIs to measure business effectiveness and drive improvement. Collaborate with central teams on data collection, integration, validation, and storage. Identify and interpret trends in complex data sets. Design and maintain dashboards (Tableau / Power BI) to support information requirements. Implement data analytic tools to enhance data analytics capabilities. Ensure compliance with data privacy regulations and robust data security measures. Stay informed about advancements in data analytics, technologies, and industry best practices. Desired Skills and Experience:Proven experience (5+ years) in a leadership role overseeing data analytics functions, preferably in the CPG industry or a related field. Bachelor's or master's degree in data science, computer science, statistics, or a related field. Expertise in data analysis, statistical modeling, data mining, and machine learning techniques. Proficiency in data visualization tools (e. g. , Tableau, Power BI) and programming languages (e. g. , Python, R, SQL). Experience with big data platforms, cloud-based data analytics solutions, and data warehousing. Strong business acumen and ability to translate complex data into actionable insights. Knowledge of regulatory requirements and best practices related to data privacy and security. Excellent communication and presentation skills, with the ability to convey complex concepts to technical and non-technical stakeholders. Proven experience with Amazon Vendor & Seller Central, Digital Shelf Tools, Full Funnel Media, and Audience Marketing Cloud data sets. Analytical thinker with strong problem-solving skills. Driven, eager to learn, and a collaborative team player. Ability to adapt to a fast-paced and dynamic work environment. Experience with global responsibilities and participating in leadership teams. Join us as the Director, Data Science & Analytics (Amazon) and lead the charge in discovering new horizons within the Amazon marketplace. Apply today to be part of our dynamic team and drive transformative growth through technology and data! This role has the opportunity to work remotely. At SharkNinja, Diversity, Equity, and Inclusion are vital to our global success. Valuing each unique voice and blending all of our diverse skills strengthens SharkNinja's innovation every day. We support ALL associates in bringing their authentic selves to work, making an impact, and having the opportunity for career acceleration. With help from our leadership, associates, and our community, we aim to have equity be a key component of the SharkNinja DNA. YOUR ROLE in leading our SUCCESS DRIVERS & representing our UNIQUE MINDSETLead us to be “RARELY SATISFIED”Make things better each day; “PROGRESS OVER PERFECTION”Use your knowledge of our consumer, understand that “DETAILS MAKE THE DIFFERENCE”Deliver something great; “WINNING IS A TEAM SPORT”Be clear and honest, “COMMUNICATING FOR IMPACT” Explore SharkNinja:InstagramLinkedInSharkNinja's Candidate Privacy Notice can be found here: https://www. sharkninja. com/candidate-privacy-notice/We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, disability, or any other class protected by legislation, and local law. SharkNinja will consider reasonable accommodations consistent with legislation, and local law. If you require a reasonable accommodation to participate in the job application or interview process, please contact SharkNinja People & Culture at accommodations@sharkninja. com",
        "requirements": ""
    }
]